src/cf/InformationRegisters/НастройкиУчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьФорматОбменаЗУП25</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписаниеДепонированныхСумм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервОтпусков</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/УчетнаяПолитикаПоНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаПоНДФЛ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсобенностиИсчисленияНДФЛ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиИсчисленияНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ОсобенностиИсчисленияНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОсобенностиИсчисленияНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтандартныеВычетыНарастающимИтогом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартныеВычетыВПределахМесячногоДохода</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаЗарплаты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПерезаполнитьЗначенияПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	Иначе
		Выборка = Результат.Выбрать();
	КонецЕсли;
	
	НастройкиУчетаЗарплаты  = РегистрыСведений.НастройкиУчетаЗарплаты.СоздатьМенеджерЗаписи();
	РезервЕжегодныхОтпусков = Справочники.Резервы.НайтиПоНаименованию("Резерв ежегодных отпусков", Истина);
	
	Пока Выборка.Следующий() Цикл
		
		НастройкиУчетаЗарплаты.Организация = Выборка.Организация;
		НастройкиУчетаЗарплаты.Прочитать();
		НастройкиУчетаЗарплаты.Организация = Выборка.Организация;
		НастройкиУчетаЗарплаты.ИспользоватьФорматОбменаЗУП25 = НастройкиУчетаЗарплаты.ИспользоватьФорматОбменаЗУП25;
		НастройкиУчетаЗарплаты.СписаниеДепонированныхСумм    = НастройкиУчетаЗарплаты.СписаниеДепонированныхСумм;
		НастройкиУчетаЗарплаты.РезервОтпусков = РезервЕжегодныхОтпусков;
		
		Попытка
			НастройкиУчетаЗарплаты.Записать();
		Исключение
			ТекстСообщения	= НСтр("ru = 'Не выполнено обновление записей регистра сведений ""Настройки учета зарплаты""'");
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПорядокПримененияВычетовПоНДФЛ() Экспорт
	
	Если Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаПоНДФЛ.ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТ_УПНДФЛ
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаПоНДФЛ КАК УчетнаяПолитикаПоНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ПОМЕСТИТЬ ВТ_Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = Организации.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Организации.Ссылка
	|ИЗ
	|	ВТ_Организации КАК ВТ_Организации,
	|	ВТ_УПНДФЛ КАК ВТ_УПНДФЛ
	|ГДЕ
	|	НЕ ВТ_Организации.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_УПНДФЛ.ГоловнаяОрганизация
	|				ИЗ
	|					ВТ_УПНДФЛ КАК ВТ_УПНДФЛ)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	УчетнаяПолитикаПоНДФЛ  = РегистрыСведений.УчетнаяПолитикаПоНДФЛ.СоздатьМенеджерЗаписи();
	Пока Выборка.Следующий() Цикл
		
		УчетнаяПолитикаПоНДФЛ.ГоловнаяОрганизация = Выборка.Ссылка;
		УчетнаяПолитикаПоНДФЛ.Прочитать();		
		УчетнаяПолитикаПоНДФЛ.ГоловнаяОрганизация = Выборка.Ссылка;
		УчетнаяПолитикаПоНДФЛ.ОсобенностиИсчисленияНДФЛ = Перечисления.ОсобенностиИсчисленияНДФЛ.СтандартныеВычетыНарастающимИтогом;
			
		Попытка
			УчетнаяПолитикаПоНДФЛ.Записать();
		Исключение
			ТекстСообщения	= НСтр("ru = 'Не выполнено обновление записей регистра сведений ""Учетная политика по НДФЛ""'");
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
